In [13]:
import pandas as pd
import numpy as np

In [14]:
# Series - 1d array like object

data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
print(type(series))

<class 'pandas.core.series.Series'>

In [16]:
data = {"a":1,"b":2,"c":3}
series = pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [17]:
data =[10,2,3,4,5]
indexes = ["a","b","c","d","e"]

pd.Series(data, index=indexes)

a    10
b     2
c     3
d     4
e     5
dtype: int64

In [18]:
# Dataframe - 2d data 

data = {
    "Name": ["Hey","you","there"],
    "Age":[34,43,23],
    "City": ["Otto","Twills","Crimsone"]
}


df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0    Hey   34      Otto
1    you   43    Twills
2  there   23  Crimsone
<class 'pandas.core.frame.DataFrame'>

In [19]:
np.array(df)

array([['Hey', 34, 'Otto'],
       ['you', 43, 'Twills'],
       ['there', 23, 'Crimsone']], dtype=object)

In [20]:
df.head(2)

  Name  Age    City
0  Hey   34    Otto
1  you   43  Twills

In [22]:
type(df['Name'])

pandas.core.series.Series

In [26]:
df.loc[1]

Name       you
Age         43
City    Twills
Name: 1, dtype: object

In [27]:
df.iloc[2]

Name       there
Age           23
City    Crimsone
Name: 2, dtype: object

In [29]:
df.at[1,'Age']

np.int64(43)

In [31]:
df.iat[2,2]

'Crimsone'

In [32]:
df['Salary'] = [3000,4000,444444]

In [33]:
df.head()

    Name  Age      City  Salary
0    Hey   34      Otto    3000
1    you   43    Twills    4000
2  there   23  Crimsone  444444

In [36]:
df.drop('Salary',axis=1, inplace=True)

In [37]:
df

    Name  Age      City
0    Hey   34      Otto
1    you   43    Twills
2  there   23  Crimsone

In [38]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [45]:
df.describe()

             Age
count   3.000000
mean   33.333333
std    10.016653
min    23.000000
25%    28.500000
50%    34.000000
75%    38.500000
max    43.000000

In [44]:
grouped = df.groupby('Name')['Age'].mean()
grouped

Name
Hey      34.0
there    23.0
you      43.0
Name: Age, dtype: float64